using System.Collections.Generic;

namespace Bot_Application3.model
{
    public class InnerData
    {
        public static Dictionary<string, string> dic = null;
        static InnerData()
        {
            dic = new Dictionary<string, string>();
            dic.Add("0", "# 金鸡献瑞迎新春，鹏程万里兴骏业！Mercedes me 电子商务平台新年新开张，6大优势服务协助您聊车/看车/选车/订车。我是在线产品大使XXXX，给您拜年了！欢迎您随时与我们聊聊在线购车的那些事儿。PS. 全新E级车以及全新GLC轿跑SUV火爆预定中！\n\n" +
                         "1. 平台亮点\n\n" +
                         "2. 金融咨询\n\n" +
                         "3. 产品介绍\n\n" +
                         "9. 人工客服\n\n"
                            );
            dic.Add("01", "1. 全景+VR互动赏车\n\n" +
                          "2. 动态真实库存\n\n" +
                          "3. 优先留车48小时\n\n" +
                          "4. 24*7在线产品大使\n\n" +
                          "5. 专属好礼\n\n" +
                          "6. 金融方案在线配置\n\n" +
                          "9. 人工客服\n\n" +
                          "0. 返回上一级\n\n"
                            );
            dic.Add("02", "1. 奔驰金融服务是什么\n\n" +
                          "2. 与银行相比奔驰金融服务的主要优势\n\n" +
                          "3. 金融服务贷款周期\n\n" +
                          "4. 审批没有通过怎么办\n\n" +
                          "9. 人工客服\n\n" +
                          "0. 返回上一级\n\n"
                            );
            dic.Add("03", "1. 全新长轴距E级轿车\n\n" +
                          "2. GLC 轿跑 SUV\n\n" +
                          "9. 人工客服\n\n" +
                          "0. 返回上一级\n\n"
                            );
            dic.Add("011", "您只需要动动手指，就可以360°全方位体验内外饰实景细节，并且可以随心切换内外饰颜色。如果您有VR眼镜更可以如同坐在车内一样，近距离的感受全新E级和GLC轿跑SUV的奢华内饰，帮助您更好地了解产品亮点\n\n"
                            );
            dic.Add("012", "平台中可预订车型均基于试点经销商的真实库存，同时根据实时订单进行动态刷新，所见即所得哦\n\n"
                            );
            dic.Add("013", "您在平台支付意向金后，所选配置的车辆将为您优先保留48小时(特殊供应车辆除外)\n\n"
                            );
            dic.Add("014", "我们全天候为您提供专业的产品讲解服务，协助您更好地选择爱车。\n\n"
                            );
            dic.Add("015", "您在线订购并完成线下购车后，我们将为您准备一份平台独有且定制您署名的Mercedes-Benz 原厂精品钥匙链。\n\n"
                            );
            dic.Add("016", "金融方案方便配：输入预算，平台自动为您配置、对比多种方案，直观便捷；\n\n" +
                            "绑定金融方案到订单：经销商在收到订单的同时了解您的金融方案需求，节省时间。\n\n"
                            );
            dic.Add("021", "梅赛德斯-\n\n" +
                            "奔驰金融服务隶属于业务辐射全球40多个国家和地区的戴姆勒金融服务集团。在中国，我们旗下拥有两家公司：梅赛德斯-奔驰汽车金融有限公司（简称“奔驰金融”）和梅赛德斯-\n\n" +
                            "奔驰租赁有限公司（简称“奔驰租赁”）。我们依托先进的国际化经验以及对本土客户需求的深刻洞察，以高品质的金融服务助力每一位贵宾实现星徽梦想。"
                            );
            dic.Add("022", "梅赛德斯-\n\n" +
                            "奔驰金融服务提供灵活多样的贷款购车及租赁服务，我们传承星徽荣耀，并与授权经销商共同合作，通过更有竞争力的利率及更简便的流程，竭力呈献创新完善的服务，帮助个人客户、中小企业及大型集团客户从容拥有梦想座驾。"
                            );
            dic.Add("023", "对于标准贷款产品来说，最短贷款期限为12个月，最长贷款期限不超过60个月；保值租购产品则提供24个月及36个月租期两种选择。我们对限时专案的期限会有特殊规定，详情请访问“限时优惠方案”页面。\n\n"
                            );
            dic.Add("024", "您可联系购车经销商店的金融专员查询或联系拨打400-898-1888进行查询。\n\n"
                            );
            dic.Add("031", "1. 内饰设计\n\n" +
                           "2. 车辆介绍\n\n" +
                           "3. 外观设计\n\n" +
                           "4. 几何多光束大灯\n\n" +
                           "0. 返回上一级\n\n"
                           );
            dic.Add("032", "1. 外形设计概述\n\n" +
                           "2. LED照明\n\n" +
                           "3. 柏林之声音响\n\n" +
                           "0. 返回上一级\n\n"
                           );
            dic.Add("0311", "加长轴距专为中国设计，令整个后排充满空间感、品质感和豪华感；豪华型后排头枕以及典雅的黑色岑木木饰，带来更加舒适的驾乘空间；后排私密三角窗可欣赏窗外世界，窗外却无法看见车内情况，出色的降噪水平带来安静的驾乘空间，开拓视野的同时增强了私密性。让驾乘者尽享触觉与视觉的双重盛宴。\n\n"
                           );
            dic.Add("0312", "时尚动感，智显非凡。全新长轴距E级运动轿车采用运动轿车外观组件，以智能科技，为中国市场量身打造，车身线条突出了车辆的运动性和独特性；长轴距专属徽标，充分突显东方文化之尊崇；AMG车身风格组件包括带独特进气口和镀铬饰件的前裙板、侧裙板饰板，以及带有梯形排气尾管饰件和镀铬饰件且具有独特的扩散式外观的后裙板，呈现时尚动感外观；时尚外观，尽显潇洒之风\n\n"
                           );
            dic.Add("0313", "全新长轴距E级轿车采用轿车外观组件，对梅赛德斯-奔驰一贯的高贵奢华进行了现代诠释。源自于梅赛德斯-迈巴赫S级轿车的灵感，专属中国的长轴距设计配以专属徽标，带来宽豁的后排空间，让驾驶和乘坐皆享舒适，且充分突显东方文化之尊崇。全新侧面腰线大气恢弘，如天际线般勾勒出优雅车身。智慧风范，浑然天成。\n\n"
                           );
            dic.Add("0314", "几何多光束LED大灯，带可独立控制的84颗LED灯，可在需要时随时通过单独控制的LED灯准确开启，并可自动根据当前道路条件及交通状况对大灯进行快速、准确的调节，大大增加行车安全性。\n\n"
                           );
        }
    }
}
